Revit 2026 API

# ExportLayerInfoCutLayerName Property

---

The cut layer name stored in value.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string CutLayerName { get; set; }
```
```vb
Public Property CutLayerName As String
	Get
	Set
```
```cpp
public:
property String^ CutLayerName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member CutLayerName : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

ExportLayerInfo Class

Autodesk.Revit.DB Namespace